EnterpriseAutomation/app/Controllers/Spk.php

SELECT *
FROM `spk`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `spk`
---
    public function index() {
        $keyword = $this->request->getVar('keyword') ? $this->request->getVar('keyword') : "";
        $currentPage = $this->request->getVar('page') ? $this->request->getVar('page') : 1;
        $perPage = $this->request->getVar('entries') ? $this->request->getVar('entries') : 5;

        $this->dataSPK = [
            'title' => 'SPK',
            'nav_active' => 2,
            'getSPK' => $this->spk->search($keyword)->paginate($perPage),

UPDATE `spk` SET `pengorder` = NULL, `tgl_selesai` = NULL, `tgl_penyerahan` = NULL, `nama_produk` = NULL, `jml_pesanan` = NULL, `tgl_upm` = NULL
WHERE `spk`.`id_spk` IN ('51')
---
    public function editSPK()
    {
        // ambil data spk yang akan diedit
        $id = $this->request->getPost('idspk');

        // lakukan validasi data spk
        $validation =  \Config\Services::validation();
        $validation->setRules([
            'idspk' => 'required',
        ]);
        $isDataValid = $validation->withRequest($this->request)->run();
        // jika data vlid, maka simpan ke database
        if($isDataValid){
            $this->spk->update($id, [
                "pengorder" => $this->request->getPost('edit_pengorder'),
                "tgl_selesai" => $this->request->getPost('edit_tgl_selesai'),
                "tgl_penyerahan" => $this->request->getPost('edit_tgl_penyerahan'),
                'nama_produk' => $this->request->getPost('edit_nama_produk'),
                'jml_pesanan' => $this->request->getPost('edit_jml_pesanan'),
                'tgl_upm' => $this->request->getPost('edit_tgl_upm'),

            ]);